
const log = {
    '2024-07-12': [
        'demo页面上线啦 🎉',
    ],
    '2024-07-13': [
        '修复了刷新页面会404的bug',
        '新增了更新日志页面',
    ],
    '2024-07-14': [
        '牌谱记录可以切换玩家排序方式',
    ],
    '2024-07-20': [
        '更改了网页的标题和图标',
        '新增了赛事列表，可以在这里查看未开始、进行中和已结束的比赛',
    ],
    '2024-07-28': [
        '新增了牌谱详情页面，展示了每局玩家分数变化趋势',
        '新增了玩家统计页面，计算了玩家总分与一些牌风统计数据',
    ],
    '2024-07-30': [
        '添加了很多图标来美化页面',
        // '玩家统计现在默认不显示一些不常见的数据，并且可以按照某一项数据排序了',
        // '牌谱记录可以搜索玩家名进行筛选，可以按照时间段过滤',
        '牌谱详情添加了本场对局的玩家数据，可以分享牌谱链接（或者直接跳转）'
    ]
}

const Changelog = () => {
    return (
        <div>
            <h1>更新日志</h1>
            <ul>
                {Object.entries(log).reverse()
                    .map(([date, changes]) => (
                        <li key={date}>
                            <h2>{date}</h2>
                            <ul>
                                {changes.map((change, index) => (
                                    <li key={index}>{change}</li>
                                ))}
                            </ul>
                        </li>
                    ))}
            </ul>
        </div>
    )
}

export default Changelog;